# AddPoint Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireframeBuilder..::..AddPoint Method
WireframeBuilder Class See Also
---
Add a point to the shape representation stored in this WireframeBuilder.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void AddPoint(
	Point GPoint
)
```

Visual Basic
---
```text
Public Sub AddPoint ( _
	GPoint As Point _
)
```

Visual C++
---
```text
public:
void AddPoint(
	Point^ GPoint
)
```

# ### Parameters
GPoint
    Type: Autodesk.Revit.DB..::..Point The point to be added.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | GPoint is not acceptable for a wireframe shape representation. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
WireframeBuilder Class
Autodesk.Revit.DB Namespace